Description: "Builds OmniDiskSweeper.pkg and uploads to Fleet"
Identifier: com.github.fleet.OmniDiskSweeper
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.OmniDiskSweeper

Input:
  NAME: OmniDiskSweeper
  self_service: true
  automatic_install: false
  categories:
  - Productivity
  
  ICON: ""
  INSTALL_SCRIPT: ""
  UNINSTALL_SCRIPT: ""
  PRE_INSTALL_QUERY: ""
  POST_INSTALL_SCRIPT: ""
  
  labels_include_any: []
  labels_exclude_any: []
  
  gitops_mode: false
  FLEET_GITOPS_SOFTWARE_DIR: lib/macos/software
  FLEET_GITOPS_TEAM_YAML_PATH: teams/workstations.yml
  s3_retention_versions: 0

Process:
- Arguments:
    pkg_path: "%pkg_path%"
    software_title: "%NAME%"
    version: "%version%"
    display_name: "%NAME%"
    icon: "%ICON%"
    install_script: "%INSTALL_SCRIPT%"
    uninstall_script: "%UNINSTALL_SCRIPT%"
    pre_install_query: "%PRE_INSTALL_QUERY%"
    post_install_script: "%POST_INSTALL_SCRIPT%"
    gitops_software_dir: "%FLEET_GITOPS_SOFTWARE_DIR%"
    gitops_team_yaml_path: "%FLEET_GITOPS_TEAM_YAML_PATH%"
    fleet_api_base: "%FLEET_API_BASE%"
    fleet_api_token: "%FLEET_API_TOKEN%"
    team_id: "%FLEET_TEAM_ID%"
    aws_s3_bucket: "%AWS_S3_BUCKET%"
    aws_cloudfront_domain: "%AWS_CLOUDFRONT_DOMAIN%"
    aws_access_key_id: "%AWS_ACCESS_KEY_ID%"
    aws_secret_access_key: "%AWS_SECRET_ACCESS_KEY%"
    aws_default_region: "%AWS_DEFAULT_REGION%"
    gitops_repo_url: "%FLEET_GITOPS_REPO_URL%"
    github_token: "%FLEET_GITOPS_GITHUB_TOKEN%"
  Processor: com.github.fleet.FleetImporter/FleetImporter
